package alnabras.net.ashora.ui.dua_alqamah;

import androidx.lifecycle.LiveData;
import androidx.lifecycle.MutableLiveData;
import androidx.lifecycle.ViewModel;

public class dua_alqamahViewModel extends ViewModel {

    private MutableLiveData<String> mText;

    public dua_alqamahViewModel() {
        mText = new MutableLiveData<>();
        mText.setValue("يا اللهُ يا اللهُ يا اللهُ ، يا مُجيب دعوة المُضطَّرين ، يا كاشف كُرب المكرُوبين ، يا غياث المُستغيثين ، يا صريخ المُستصرخين ، يا من هُو أقربُ إليَّ من حبل الوريد ، يا من يحُولُ بين المرء وقلبه ، ويا من هُو بالمنظر الاعلى ، وبالاُفُق المُبين ، ويا من هُو الرَّحمنُ الرَّحيمُ على العرش استوى ، ويا من يعلمُ خائِنة الاعيُن وما تُخفي الصُّدُورُ ، ويا من لأ يخفى عليه خافية ، يا من لأ تشتبهُ عليه الاصواتُ ، ويا من لاتُغلِّطُهُ الحاجاتُ ، ويا من لأ يُبرمُهُ إلحاحُ المُلحِّين ، ويا مُدرك كُلِّ فوت ، ويا جامع كُلِّ شمل ، ويا بارئَ النُّفُوس بعد الموت ، يا من هُو كُلَّ يوم في شأْن ، يا قاضي الحاجات ، يا مُنفِّس الكُرُبات ، يا مُعطي السُّؤلات ، يا وليَّ الرَّغبات ، يا كافي المُهمَّات ، يا من يكفي من كُلِّ شيء ولا يكفي منهُ شي في السَّموات والارض ، أَسأَلُك بحقِّ مُحمَّد خاتم النبيين وعليٍّ أمير المُؤمنين ، وبحقّ فاطمة بنت نبيِّك ، وبحقِّ الحسن والحُسين.\n" +
                "\n" +
                "فإنِّي بهم أتوجَّهُ إليك في مقامي هذا ، وبهم أتوسَّلُ ، وبهم أتشفَّعُ إليك ، وبحقِّهم أَسأَلُك واُقسمُ وأعزمُ عليك ، وبالشَّأْن الَّذي لهُم عندك وبالقدر الّذي لهُم عندك ، وبالَّذي فضَّلتهُم على العالمين ، وباسمك الّذي جعلتهُ عندهُم ، وبه خصصتهُم دُون العالمين ، وبه أبنتهُم وأَبنت فضلهُم من فضل العالمين حتَّى فاق فضلُهُم فضل العالمين جميعا أسألُك أن تُصلِّي على مُحمَّد وآل مُحمَّد وأن تكشف عنِّي غمِّي وهمِّي وكربي ، وتكفيني المُهمَّ من اُمُوري ، وتقضي عنِّي ديني ، وتُجيرني من الفقر ، وتجيرني من الفاقة ، وتُغنيني عن المسأَلة إلى المخلُوقين ، وتكفيني همَّ من أخافُ همَّهُ ، وجور من أَخافُ جوره ، وعُسر من أخافُ عُسرهُ ، وحُزُونة من أخافُ حُزُونتهُ ، وشرَّ من أخافُ شرَّهُ ، ومكر من أخافُ مكرهُ ، وبغي من أخافُ بغيهُ ، وسُلطان من أخافُ سُلطانهُ ، وكيد من أخافُ كيدهُ ، ومقدُرة من أخافُ مقدُرته عليَّ ، وترُدَّ عنِّي كيد الكيدة ، ومكر المكرة.\n" +
                "\n" +
                "اللهُمَّ من أرادني فأردهُ ، ومن كادني فكدهُ ، واصرفُ عنِّي كيدهُ ومكرهُ وبأْسهُ وأمانيَّهُ ، وامنعهُ عنِّي كيف شئْت ، وأنّّى شئْت. اللهُمَّ اشغلهُ عنِّي بفقر لا تجبُرُهُ ، وببلاء لا تستُرُهُ ، وبفاقة لا تسُدَّها ، وبسُقم لا تُعافيه ، وذُلٍّ لا تُعزُّهُ ، وبمسكنة لا تجبُرُها. اللهُمَّ اضرب بالذُلِّ نصب عينيه ، وادخل عليه الفقر في منزله ، والعلَّة والسَّقم في بدنه ، حتَّى تشغلهُ عنِّي بشُغل شاغل لا فراغ لهُ ، وأنسه ذكري كما أنسيتهُ ذكرك ، وخُذ عنِّي بسمعه وبصره ولسانه ويده ورجله وقلبه وجميع جوارحه ، وأدخل عليه في جميع ذلك السُّقم ، ولا تشفه حتَّى تجعل ذلك لهُ شُغلا شاغلا به عنِّي وعن ذكري واكفني يا كافي ما لا يكفي سواك فإنَّك الكافي لا كافي سواك ، ومُفرِّج لا مُفرِّج سواك ، ومُغيث لا مُغيث سواك ، وجار لا جار سواك ، خاب من كان جارُهُ سواك ، ومُغيثُهُ سواك ، ومفزعُهُ إلى سواك ، ومهربُهُ إلى سواك ، وملجأُهُ إلى غيرك ، ومنجاهُ من مخلُوق غيرك ، فأنت ثقتي ورجائِي ومفزعي ومهربي وملجاي ومنجاي ، فبك أستفتحُ ، وبك أستنجحُ ، وبمُحمَّد وآل مُحمَّد أَتوجَّهُ إليك وأتوسَّلُ وأتشفَّعُ ، فأَسأَلُك يا اللهُ يا اللهُ يا اللهُ ، فلك الحمدُ ، ولك الشُّكرُ ، وإليك المُشتكى وأنت المُستعانُ ، فأسألُك يا اللهُ يا اللهُ يا اللهُ ، بحقِّ مُحمَّد وآل مُحمَّد أن تُصلِّي على مُحمَّد وآل مُحمَّد وأَن تكشف عنِّي غمِّي وهمِّي وكربي في مقامي هذا كما كشفت عن نبيِّك همَّهُ وغمَّهُ وكربهُ ، وكفيتهُ هول عدُوِّه ، فاكشف عنِّي كما كشفت عنهُ ، وفرِّج عنِّي كما فرَّجت عنهُ ، واكفني كما كفيتهُ واصرف عنّي هول ما أخافُ هولهُ ومؤُونة ما أخافُ مؤُونتهُ ، وهمَّ ما أخافُ همَّهُ بلا مؤُونة على نفسي من ذلك ، واصرفني بقضاء حوائِجي ، وكفاية ما أهمَّني همُّهُ من أمر آخرتي ودُنياي.\n" +
                 "\n" +
                "يا أمير المُؤْمنين ويا أبا عبد الله ، عليكُما منِّي سلامُ الله أبدا ما بقي الليلُ والنَّهارُ ، ولا جعلهُ اللهُ آخر العهد من زيارتكُما ولا فرَّق اللهُ بيني وبينكُما.\n" +
                "\n" +
                "اللهُمَّ أحيني حياة مُحمَّد صلّى الله عليه وآله وذُرِّيَّته ، وأمتني مماتهُم ، وتوفَّني على ملَّتهم ، واحشُرني في زُمرتهم ، ولا تُفرِّق بيني وبينهُم طرفة عين أبدا في الدُّنيا والاخرة.\n" +
                "\n" +
                "يا أمير المُؤْمنين ويا أبا عبدالله ، أَتيتُكُما زائِرا ومُتوسِّلا إلى الله ربِّي وربِّكُما ، ومُتوجِّها إليه بكُما ، ومُستشفعا بكُما إلى الله تعالى في حاجتي هذه فاشفعا لي فإنَّ لكُما عند الله المقام المحمُود ، والجاه الوجيه ، والمنزل الرَّفيع والوسيلة ، إنِّي أنقلبُ عنكُما مُنتظرا لتنجُّز الحاجة وقضائِها ونجاحها من الله بشفاعتكُما لي إلى الله في ذلك فلا أخيبُ ، ولا يكُونُ مُنقلبي مُنقلبا خائِبا خاسرا بل يكُونُ مُنقلبي مُنقلبا راجحا مُفلحا مُنجحا مُستجابا بقضاء جميع الحوائِج وتشفعا لي إلى الله ، انقلبتُ على ما شاء اللهُ ولا حول ولا قُوَّة إلاّ بالله ، ومُفوِّضا أمري إلى الله ، مُلجئا ظهري إلى الله ، مُتوكِّلا على الله ، وأقُولُ حسبي اللهُ وكفى ، سمع اللهُ لمن دعا ، ليس لي وراء الله ووراءكُم يا سادتي مُنتهى ، ما شاء ربِّي كان ، وما لم يشأْ لم يكُن ، ولا حول ولا قُوَّة إلاّ بالله أستودعُكُم الله ، ولا جعلهُ اللهُ آخر العهد منِّي إليكُما ، انصرفتُ يا سيِّدي يا أمير المُؤْمنين ومولاي وأنت يا أبا عبدالله ، يا سيّدي وسلامي عليكُما مُتَّصل ما اتَّصل الليلُ والنَّهارُ واصل ذلك إليكُما غيرُ محجُوب عنكُما ، سلأمي إن شاء ، اللهُ وأسأَلُهُ بحقِّكُما أن يشاء ذلك ويفعل فإنَّهُ حميد مجيد ،نقلبتُ يا سيِّديَّ عنكُما تائِبا حامدا لله ، شاكرا راجيا للاجابة ، غير آيس ولا قانط ، آئِبا عائِدا راجعا إلى زيارتكُما غير راغب عنكُما ولا عن زيارتكُما ، بل راجع عائِد إن شاء اللهُ ، ولا حول ولا قُوَّة إلاَّ بالله العليِّ العظيم ، يا سادتي رغبتُ إليكُما وإلى زيارتكُما بعد أن زهد فيكُما وفي زيارتكُما أهلُ الدُّنيا فلا خيَّبني اللهُ ما رجوتُ ، وما أمّلتُ في زيارتكُما ، إنّه قريب مُجيب.\n" +
                "");
    }

    public LiveData<String> getText() {
        return mText;
    }
}