package alnabras.net.ashora.ui.zayart_ashora;

import androidx.lifecycle.LiveData;
import androidx.lifecycle.MutableLiveData;
import androidx.lifecycle.ViewModel;

public class zayart_ashora_ViewModel extends ViewModel {

    private MutableLiveData<String> mText;

    public zayart_ashora_ViewModel() {
        mText = new MutableLiveData<>();
        mText.setValue("السَّلأمُ عَلَيْكَ يَا أبَا عَبْدِاللهِ ، السَّلأمُ عَلَيْكَ يَا ابْنَ رَسُولِ اللهِ ، السَّلأمُ عَلَيْكَ يَا ابْنَ أمِيرِ المُؤْمِنينَ ، وَابْنَ سَيِّدِ الوَصِيِّينَ ، السَّلأمُ عَلَيْكَ يَا ابْنَ فاطِمَةَ الزّهراءِ سَيِّدَةِ نِساءِ العالَمِينَ ، السَّلأمُ عَلَيْكَ يَا ثَارَ اللهِ وابْنَ ثارِهِ وَالْوِتْرَ المَوْتُورَ ، السَّلأمُ عَلَيْكَ وَعَلَى الارْواحِ الّتي حَلّتْ بِفِنائِكَ ، وَأنَاخَتْ بِرحْلِك عَلَيْكُمْ مِنّي جَميعاً سَلامُ اللهِ أبَداً ما بَقِيتُ وَبَقِيَ الليْلُ وَالنَّهارُ.\n" +
                "\n" +
                "يَا أبَا عَبْدِ اللهِ ، لَقَدْ عَظُمَتِ الرَّزِيَّةُ ، وجَلّتْ وعَظُمَتْ المُصِيبَةُ بِكَ عَلَيْنا وَعَلَى جَمِيعِ أهْلِ الاسْلام ، وَجَلَّتْ وَعَظُمَتْ مُصِيبَتُكَ فِي السَّمَوَاتِ عَلَى جَمِيعِ أهْلِ السَّمَوَاتِ ، فَلَعَنَ اللهُ اُمَّةً أسَّسَتْ أساسَ الظُّلْمِ وَالجَوْرِ عَلَيْكُمْ أهْلَ البَيْتِ ، وَلَعَنَ اللهُ اُمَّةً دَفَعَتْكُمْ عَنْ مَقامِكُمْ وَأزالَتْكُمْ عَنْ مَراتِبِكُمُ الّتِي رَتَّبَكُمُ اللهُ فِيها ، وَلَعَنَ اللهُ اُمَّةً قَتَلَتْكُمْ ، وَلَعَنَ اللهُ الْمُمَهِّدِينَ لَهُمْ بِالتَّمْكِينِ مِنْ قِتالِكُمْ ، بَرِئْتُ إلى اللهِ وَإلَيْكُمْ مِنْهُمْ وَمِنْ أشْياعِهِمْ وَأتْباعِهِمْ وَأوْلِيائِهِمْ.\n" +
                "\n" +
                "يَا أبَا عَبْدِاللهِ ، إنِّي سِلْمٌ لِمَنْ سالَمَكُمْ ، وَحَرْبٌ لِمَنْ حارَبَكُمْ وَوليٌ لِمَنْ والاكُم وعدوٌّ لِمَنْ عَاداكُمْ إلى يَوْمِ القِيامَةِ ، وَلَعَنَ اللهُ آل زِيَاد وَآلَ مَرْوانَ ، وَلَعَنَ اللهُ بَنِي اُمَيَّةَ قاطِبَةً ، وَلَعَنَ اللهُ ابْنَ مَرْجانَةَ ، وَلَعَنَ اللهُ عُمَرَ بْنَ سَعْد ، وَلَعَنَ اللهُ شِمْراً ، وَلَعَنَ اللهُ اُمَّةً أسْرَجَتْ وَألْجَمَتْ وَتَهيّأتْ وَتَنَقَّبَتْ لِقِتالِكَ ، بِأبِي أنْتَ وَاُمِّي لَقَدْ عَظُمَ مُصابِي بِكَ ، فَأسْالُ اللهَ الّذِي أكْرَمَ مَقامَكَ ، وَأكْرَمَنِي بِكَ ، أنْ يَرْزُقَني طَلَبَ ثارِكَ مَعَ إمام مَنْصُور مِنْ أهْلِ بَيْتِ مُحَمَّد صَلّى الله عَلَيْهِ وَآلِهِ.\n" +
                "\n" +
                "اللهمّ اجْعَلْني عِنْدَكَ وَجِيهاً بِالحُسَيْنِ عَلَيهِ السَّلأم فِي الدُّنْيا وَالاخِرَةِ مِنَ المقَرّبينْ.\n" +
                "\n" +
                "يَا أبَا عَبْداللهِ ، إنِّي أتَقَرَّبُ إلى اللهِ تعالى ، وَإلَى رَسُولِهِ ، وَإلى أمِيرِ المُؤْمِنينَ ، وَإلَى فاطِمَةَ ، وإلى الحَسَنِ وَإلَيْكَ بِمُوالاتِكَ ، ومُوالاةِ أَوليائِك وَبِالْبَرَاءَةِ مِمَّنْ قَاتَلَكَ وَنَصبَ لَكَ الحَربَ ، وبالْبَرَاءةِ مِمَّنْ أسَّسَ أساسَ الظُّلْمِ وَالجَوْرِ عَلَيْكُمْ ، وَعلى أشياعِكُم وَأبْرَأُ إلى اللهِ وَإلى رَسُولِهِ وَبِالبراءِةِ مِمَّنْ أسَّسَ أساسَ ذلِكَ ، وَبَنى عَلَيْهِ بُنْيانَهُ ، وَجَرَى في ظُلْمِهِ وَجَوْرِهِ عَلَيْكُمْ وَعَلَى أشْياعِكُمْ ، بَرِئْتُ إلى اللهِ وَإلَيْكُمْ مِنْهُمْ ، وَأتَقَرَّبُّ إلى اللهِ وَإلى رَسولِهِ ثُمَّ إلَيْكُمْ بِمُوالاتِكُم وَمُوالاةِ وَلِيِّكُمْ ، وَبِالْبَرَاءَةِ مِنْ أعْدائِكُمْ ،وَالنَّاصِبِينَ لَكُم الحَرْبَ ، وَبِالبَرَاءَةِ مِنْ أشْياعِهِمْ وَأتْباعِهِمْ ، يا أبا عَبدِ الله إنِّي سِلْمٌ لِمَنْ سالَمَكُمْ ، وَحَرْبٌ لِمَنْ حارَبَكُمْ ، وَوَلِيٌّ لِمَنْ والاكُمْ ، وَعَدُوٌّ لِمَنْ عاداكُمْ ، فَأسْألُ اللهَ الّذِي أكْرَمَني بِمَعْرِفَتِكُمْ ، وَمَعْرِفَةِ أوْلِيائِكُمْ ، وَرَزَقَني البَراءَةَ مِنْ أعْدائِكُمْ ، أنْ يَجْعَلَني مَعَكُمْ في الدُّنْيا وَالاخِرَةِ ، وَأنْ يُثَبِّتَ لي عِنْدَكُمْ قَدَمَ صِدْق في الدُّنْيا وَالاخِرَةِ ، وَأسْألُهُ أنْ يُبَلِّغَنِي الْمقامَ الْمَحْمُودَ لَكُمْ عِنْدَ اللهِ ، وَأنْ يَرْزُقَنِي طَلَبَ ثَارِي مَعَ إمَام مَهْدِيٍّ ظَاهِر نَاطِق بالحقِّ مِنْكُمْ ، وَأسْألُ اللهَ بِحَقِّكُمْ وَبِالشَّأنِ الَّذِي لَكُمْ عِنْدَهُ أنْ يُعْطِيَنِي بِمُصابِي بِكُمْ أفْضَلَ ما يُعْطِي مصاباً بِمُصِيبَتِهِ ، يا لَها منْ مُصِيبَة مَا أعْظَمَها وَأعْظَمَ رَزِيّتهَا فِي الاسْلامِ وَفِي جَمِيعِ أهلِ السَّموَاتِ وَالارْضِ.\n" +
                "\n" +
                "اللهُمَّ اجْعَلْني في مَقامِي هذا مِمَّن تَنالُهُ مِنْكَ صَلَواتٌ وَرَحْمَةٌ وَمَغْفِرَةٌ.\n" +
                "\n" +
                "اللهُمَّ اجْعَلْ مَحْيايَ مَحْيا مُحَمَّد وَآلِ مُحَمَّد ، وَمَماتي مَماتَ مُحَمَّد وَآل ِمُحَمَّد.\n" +
                "\n" +
                "اللهُمَّ إنَّ هَذا يَوْمٌ تَبَرَّكَتْ بِهِ بَنُو اُمَيَّةَ وَابْنُ آكِلَةِ الاكْبادِ ، اللعِينُ بْنُ ال لعِينِ عَلَى لِسانِكَ وَلِسانِ نَبِيِّكَ صَلّى الله عَلَيْهِ وَآلِهِ في كُلِّ مَوْطِن وَمَوْقِف وَقَفَ فِيهِ نَبيُّكَ صَلّى الله عَلَيْهِ وَآلِهِ.\n" +
                "\n" +
                "اللهُمَّ الْعَنْ أبَا سُفْيانَ وَمُعَاوِيَةَ وَيَزيدَ بْنَ مُعَاوِيَةَ وآلَ مَرْوَانَ عَلَيْهِمْ مِنْكَ اللعْنَةُ أبَدَ الابِدِينَ ، وَهذا يَوْمٌ فَرِحَتْ بِهِ آلُ زِيَاد وَآلُ مَرْوانَ عَليهِمُ اللَّعْنةُ بِقَتْلِهِمُ الحُسَيْنَ عَلَيْهِ السَّلأم. اللهُمَّ فَضاعِفْ عَلَيْهِمُ اللعْنَ وَالعَذابَ الالِيم.\n" +
                "\n" +
                "اللهُمَّ إنِّي أتَقَرَّبُّ إلَيْكَ في هذَا اليَوْمِ ، وَفِي مَوْقِفِي هَذا ، وَأيَّامِ حَيَاتِي بِالبَرَاءَةِ مِنْهُمْ ، وَاللعْنَةِ عَلَيْهِمْ ، وَبِالْمُوالاةِ لِنَبِيِّكَ وَآلِ نَبِيِّكَ عَلَيِه وعَلَيْهِمُ السَّلأمُ.\n" +
                "\n" +
                "ثمّ يقول:\n" +
                "\n" +
                "اللهُمَّ الْعَنْ أوّلَ ظالِم ظَلَمَ حَقَّ مُحَمَّد وَآلِ مُحَمَّد ، وَآخِرَ تَابِع لَهُ عَلَى ذلِكَ ، اللهُمَّ الْعَنِ العِصابَةَ الَّتِي جاهَدَتِ الْحُسَيْنَ عَلَيْهِ السَّلأم وَشايَعَتْ وَبايَعَتْ وَتابَعَتْ عَلَى قَتْلِهِ. اللهُمَّ الْعَنْهم جَميعاً ( يقول ذلك مائة مرّة).\n" +
                "\n" +
                "ثمّ يقول:\n" +
                "\n" +
                "السَّلأمُ عَلَيْكَ يَا أبا عَبْدِاللهِ وَعلَى الارْواحِ الّتي حَلّتْ بِفِنائِكَ، وَأنَاخَت برَحْلِك عَلَيْكَ مِنِّي سَلامُ اللهِ أبَداً مَا بَقِيتُ وَبَقِيَ الليْلُ وَالنَّهارُ، وَلا جَعَلَهُ اللهُ آخِرَ العَهْدِ مِنِّي لِزِيَارَتِكُمْ، أهْلَ البَيتِ السَّلأمُ عَلَى الحُسَيْن، وَعَلَى عَليِّ بْنِ الحُسَيْنِ، وَعَلَى أوْلادِ الحُسَيْنِ، وَعَلَى أصْحابِ الحُسَينِ الذينَ بَذَلُوا مُهَجَهُم دُونَ الحُسين (يقول ذلك مائة مرّة).\n" +
                "\n" +
                "ثمّ يقول:\n" +
                "\n" +
                "اللهمَّ خُصَّ أنْتَ أوّلَ ظالم بِاللّعْنِ مِنِّي ، وَابْدَأْ بِهِ أوّلاً ، ثُمَّ الثَّانِي ، وَالثَّالِثَ وَالرَّابِع.\n" +
                "\n" +
                "اللهُمَّ الْعَنْ يزِيَدَ خامِساً ، وَالْعَنْ عُبَيْدَاللهِ بْنَ زِيَاد وَابْنَ مَرْجانَةَ وَعُمَرَ بْنَ سَعْد وَشِمْراً وَآلَ أبي سُفْيانَ وَآلَ زِيَاد وآلَ مَرْوانَ إلَى يَوْمِ القِيامَةِ.\n" +
                "\n" +
                "ثم تسجد وتقول:\n" +
                "\n" +
                "اللهمَّ لَكَ الحَمْدُ حَمْدَ الشَّاكِرينَ لَكَ عَلَى مُصابِهِمْ ، الحَمْدُ للهِ عَلَى عَظِيمِ رَزِيّتي.\n" +
                "\n" +
                " اللهُمَّ ارْزُقْني شَفاعَةَ الحُسَيْن عَلَيهِ السَّلأم يَوْمَ الوُرُودِ ، وَثَبِّتْ لي قَدَمَ صِدْق عِنْدَكَ مَعَ الحُسَيْنِ وَأصْحابِ الحُسَيْن الّذِينَ بَذَلُوا مُهَجَهُمْ دُونَ الْحُسَيْن عَلَيْهِ السَّلأم.\n" +

                " ");
    }

    public LiveData<String> getText() {
        return mText;
    }
}